export const QuestionsDataRu = [
  {
    id: 1,
    question: 'Что такое исламский YouTube для детей?',
    answer: `Наш YouTube для детей — это безопасная платформа, где дети могут смотреть образовательные видео, соответствующие исламским ценностям. Мы предлагаем контент, который поможет детям лучше понимать свою религию, ценности, а также научит важным жизненным урокам.`,
  },
  {
    id: 2,
    question: 'Какую тему можно найти на нашем YouTube?',
    answer: `Мы предлагаем видео на различные темы: от истории Ислама, до рассказов о Пророках, Азан, изучение арабского языка, а также много познавательных мультфильмов и историй о важных исламских праздниках и традициях.`,
  },
  {
    id: 3,
    question: 'Для какого возраста подходит контент на нашем YouTube?',
    answer: `Наш контент ориентирован на детей от 4 до 12 лет. Мы стараемся сделать его доступным и понятным для детей разного возраста, обеспечивая безопасную и образовательную среду.`,
  },
  {
    id: 4,
    question: 'Можно ли на нашем YouTube смотреть мультики?',
    answer: `Да, у нас есть множество исламских мультфильмов, которые учат детей важным жизненным урокам: честности, уважению к родителям, любви к Пророку Мухаммаду (мир ему) и многому другому.`,
  },
  {
    id: 5,
    question: 'Почему наш YouTube безопасен для детей?',
    answer: `Мы гарантируем, что весь контент соответствует исламским нормам и стандартам. Мы тщательно проверяем каждое видео и убеждаемся, что оно не содержит неподобающего контента.`,
  },
  {
    id: 6,
    question: 'Как подписаться на наш YouTube?',
    answer: `Чтобы подписаться на наш YouTube, просто создайте аккаунт на платформе и нажмите на кнопку "Подписаться". Это откроет доступ к новым видео и образовательным материалам, которые мы регулярно добавляем.`,
  },
  {
    id: 7,
    question: 'Можно ли скачать видео с нашего YouTube?',
    answer: `Мы предлагаем возможность скачать некоторые видео для offline-просмотра. Это можно сделать через наше приложение или через сайт, если такая опция доступна для конкретного контента.`,
  },
  {
    id: 8,
    question: 'Есть ли возможность комментировать видео?',
    answer: `На нашей платформе доступна возможность комментировать видео, но все комментарии проходят модерацию, чтобы обеспечить безопасность и соблюдение исламских норм.`,
  },
  {
    id: 9,
    question: 'Можно ли смотреть видео на разных устройствах?',
    answer: `Да, наш YouTube доступен на различных устройствах, включая компьютеры, планшеты и смартфоны. Вы можете смотреть видео в любое удобное время.`,
  },
  {
    id: 10,
    question: 'Как мы защищаем детей на нашей платформе?',
    answer: `Мы применяем передовые технологии для защиты данных наших пользователей и предотвращения доступа к неподобающему контенту. Все видео проходят тщательную проверку на соответствие стандартам безопасности для детей.`,
  },
  {
    id: 11,
    question: 'Что делать, если возникнут проблемы с платформой?',
    answer: `Если у вас возникнут проблемы, свяжитесь с нашей службой поддержки. Мы всегда готовы помочь и ответить на ваши вопросы.`,
  },
  {
    id: 12,
    question: 'Могу ли я делиться видео с других платформ?',
    answer: `Мы поддерживаем возможность делиться нашими видео с других платформ, чтобы распространять полезный контент среди детей и родителей.`,
  },
  {
    id: 13,
    question: 'Какую информацию о ребенке я должен предоставить для регистрации?',
    answer: `Мы ценим вашу безопасность и конфиденциальность. При регистрации вам нужно будет указать только минимальную информацию о вашем ребенке, такую как возраст и интересы, чтобы мы могли порекомендовать соответствующий контент.`,
  },
  {
    id: 14,
    question: 'Почему нужно соблюдать правила нашей платформы?',
    answer: `Соблюдение правил помогает создать безопасную и благоприятную атмосферу для детей, где они могут обучаться, развиваться и наслаждаться контентом в соответствии с исламскими принципами.`,
  },
];




export const QuestionsDataKy = [
  {
    id: 1,
    question: 'Исламдык YouTube балдар үчүн эмнени билдирет?',
    answer: `Биздин YouTube балдар үчүн — бул балдар исламдык баалуулуктарга шайкеш келген билим берүүчү видеолорду көрө турган коопсуз платформа. Биз балдарга өз динин, баалуулуктарын жакшыраак түшүнүүгө жардам берүүчү контентти сунуштайбыз, ошондой эле жашоо сабактарын үйрөтөбүз.`,
  },
  {
    id: 2,
    question: 'Биздин YouTube платформасында кандай темалар бар?',
    answer: `Биз видеолорду ар кандай темаларда сунуштайбыз: Ислам тарыхы, Пайгамбарлар тууралуу окуялар, Азан, араб тилин үйрөнүү, ошондой эле маанилүү исламдык майрамдар жана салттар тууралуу көптөгөн билими бар мультфильмдер жана окуялар.`,
  },
  {
    id: 3,
    question: 'Биздин YouTube канча жаштагы балдар үчүн ылайыктуу?',
    answer: `Биздин контент 4-12 жаштагы балдарга багытталган. Биз ар бир жаш курагына ылайыктуу жана түшүнүктүү кылып контентти даярдаганга аракет кылып, коопсуз жана билимдүү чөйрөнү камсыздайбыз.`,
  },
  {
    id: 4,
    question: 'Биздин YouTube мультфильмдерин көрүүгө болобу?',
    answer: `Ооба, бизде көптөгөн исламдык мультфильмдер бар, алар балдарды жашоо сабактарына үйрөтөт: адилеттүүлүк, ата-энелерге урмат, Пайгамбар Мухаммадга (алейхи салам) болгон сүйүү жана башка маанилүү баалуулуктар.`,
  },
  {
    id: 5,
    question: 'Биздин YouTube балдар үчүн кантип коопсуз?',
    answer: `Биз бардык контентти исламдык нормаларга жана стандарттарга шайкеш келет деп кепилдик беребиз. Ар бир видеону кылдаттык менен текшерип, анын жараксыз контентти камтыбай турганына ишенебиз.`,
  },
  {
    id: 6,
    question: 'Биздин YouTube кантип жазыла алам?',
    answer: `Биздин YouTube жазылуу үчүн, платформага аккаунт түзүп, "Жазылуу" баскычын басыңыз. Бул сизге жаңы видеолорго жана билим берүүчү материалдарга жеткиликтүүлүк берет, аларды биз үзгүлтүксүз жаңыртып турабыз.`,
  },
  {
    id: 7,
    question: 'Биздин YouTube видеолорун жүктөп ала аламбы?',
    answer: `Бизде айрым видеолорду офлайн көрүү үчүн жүктөп алуу мүмкүнчүлүгү бар. Бул сиздин колдонуучу тиркемеңиз же вебсайт аркылуу, эгер мындай опция атайын контент үчүн жеткиликтүү болсо, ишке ашырылат.`,
  },
  {
    id: 8,
    question: 'Видеолорго комментарий калтыруу мүмкүнбү?',
    answer: `Биздин платформда видеолорго комментарий калтыруу мүмкүнчүлүгү бар, бирок бардык комментарийлер модерациядан өтөт, андыктан коопсуздук жана исламдык нормалар сакталат.`,
  },
  {
    id: 9,
    question: 'Видео ар кандай түзүлүштөрдө көрө аламбы?',
    answer: `Ооба, биздин YouTube ар кандай түзүлүштөрдө, анын ичинде компьютерлерде, планшеттерде жана смартфондордо жеткиликтүү. Сиз видеолорду каалаган убакта көрө аласыз.`,
  },
  {
    id: 10,
    question: 'Биз кантип балдарды биздин платформабызда коргойбуз?',
    answer: `Биз пайдаланган технологиялар балдардын маалыматтарын коргоо жана жараксыз контентке кирүүгө тоскоол болуу үчүн алдыңкы ыкмаларды колдонобуз. Ар бир видео балдар үчүн коопсуздук стандарттарына жооп берет деп кылдаттык менен текшерилет.`,
  },
  {
    id: 11,
    question: 'Платформа боюнча көйгөйлөр болсо эмне кылыш керек?',
    answer: `Эгерде сизде көйгөйлөр болсо, биздин колдоо кызматына кайрылыңыз. Биз ар дайым жардам берүүгө жана суроолоруңузга жооп берүүгө даярбыз.`,
  },
  {
    id: 12,
    question: 'Башка платформалардан видеолорду бөлүшүүгө болобу?',
    answer: `Биз биздин видеолорду башка платформалардан бөлүшүүгө колдоп жатабыз, бул аркылуу балдар жана ата-энелер арасында пайдалуу контентти жайылтууга жардам берет.`,
  },
  {
    id: 13,
    question: 'Балама каттоо үчүн кандай маалыматтарды берсем болот?',
    answer: `Биз сиздин коопсуздугуңузду жана жеке маалыматтарыңызды баалайбыз. Каттоо учурунда сиз баланын жашы жана кызыкчылыктарынан башка минималдуу маалыматты гана берүүңүз керек, биз ошондой эле тиешелүү контентти сунуштай алабыз.`,
  },
  {
    id: 14,
    question: 'Биздин платформанын эрежелерин сактоо эмне үчүн маанилүү?',
    answer: `Эрежелерди сактоо балдар үчүн коопсуз жана жагымдуу чөйрөнү түзүүгө жардам берет, ошондуктан алар исламдык принциптерге ылайык контентти көрүп, билим алып, өнүгүшөт.`,
  },
];

  