import HomePage from './../assets/images/projectMTUB/HomePage.png';
import SearchPage from './../assets/images/projectMTUB/Search Page.png';
import HomePagecompass from './../assets/images/projectMTUB/Home Page compass.png';
import HomePageadditionalmenu from './../assets/images/projectMTUB/HomePageadditionalmenu.png';
import ShortsPage from './../assets/images/projectMTUB/ShortsPage.png';
import AboutPageId6 from './../assets/images/projectMTUB/AboutPageId6.png';
import VideoPlaybackPageId7 from './../assets/images/projectMTUB/VideoPlaybackPageId7.png';
import VideoPlaybackPageSettingsId8 from './../assets/images/projectMTUB/VideoPlaybackPageSettingsId8.png';
import VideoPlaybackPagefullscreenId9 from './../assets/images/projectMTUB/VideoPlaybackPagefullscreenId9.png';
import VideoPlaybackPagemoreId10 from './../assets/images/projectMTUB/VideoPlaybackPagemoreId10.png';
import PersonalPageMainId11 from './../assets/images/projectMTUB/PersonalPageMainId11.png';
import VideoPlaybackPageShareId12 from './../assets/images/projectMTUB/VideoPlaybackPageShareId12.png';
import VideoPlaybackPageellipsisId13 from './../assets/images/projectMTUB/VideoPlaybackPageellipsisId13.png';
import ShortsPageellipsisId14 from './../assets/images/projectMTUB/ShortsPageellipsisId14.png';
import PersonalPageMainId15 from './../assets/images/projectMTUB/PersonalPageMainId15.png';
import PersonalPageVideoId16 from './../assets/images/projectMTUB/PersonalPageVideoId16.png';
import PersonalPageShortsId17 from './../assets/images/projectMTUB/PersonalPageShortsId17.png';
import PersonalPageVideoId18 from './../assets/images/projectMTUB/PersonalPageVideoId18.png';
import SearchPageVoiceactiveId19 from './../assets/images/projectMTUB/SearchPageVoiceactiveId19.png';
import SearchPageVoiceinactiveId20 from './../assets/images/projectMTUB/SearchPageVoiceinactiveId20.png';
import SearchPageMusicinactiveId21 from './../assets/images/projectMTUB/SearchPageMusicinactiveId21.png';
import SearchPageMusicactiveId22 from './../assets/images/projectMTUB/SearchPageMusicactiveId22.png';
import HomePagecompass23 from './../assets/images/projectMTUB/HomePagecompass23.png';
import Homepagetrendcartoon24 from './../assets/images/projectMTUB/Homepagetrendcartoon24.png';
import Homepagetrendsettinf25 from './../assets/images/projectMTUB/Homepagetrendsettinf25.png';
import Homepagetrendadditionalmeny26 from './../assets/images/projectMTUB/Homepagetrendadditionalmeny26.png';
import HomepageVideoGameId27 from './../assets/images/projectMTUB/HomepageVideoGameId27.png';
import HomepageBlogersId28 from './../assets/images/projectMTUB/HomepageBlogersId28.png';
import HomepageNashidId29 from './../assets/images/projectMTUB/HomepageNashidId29.png';
import HomepageVideoGamesettingId30 from './../assets/images/projectMTUB/HomepageVideoGamesettingId30.png';
import HomepageVideoGameadditionalmenyId31 from './../assets/images/projectMTUB/HomepageVideoGameadditionalmenyId31.png';
import ReferenceId32 from './../assets/images/projectMTUB/ReferenceId32.png';
import HomePageadditionalmenuId33 from './../assets/images/projectMTUB/HomePageadditionalmenuId33.png';
import HomePageadditionalmenucomplainId34 from './../assets/images/projectMTUB/HomePageadditionalmenucomplainId34.png';
import AboutPageId35 from './../assets/images/projectMTUB/AboutPageId35.png';
import AboutPageSettingId36 from './../assets/images/projectMTUB/AboutPageSettingId36.png';
import AboutPageSettingContinueId37 from './../assets/images/projectMTUB/AboutPageSettingContinueId37.png';
import AboutPagenotificationId38 from './../assets/images/projectMTUB/AboutPagenotificationId38.png';
import AboutPagehistoryId39 from './../assets/images/projectMTUB/AboutPagehistoryId39.png';
import AboutPageWatchlaterId40 from './../assets/images/projectMTUB/AboutPageWatchlaterId40.png';
import AboutPagesavedAlld41 from './../assets/images/projectMTUB/AboutPagesavedAlld41.png';
import AboutPagesavedvideoId42 from './../assets/images/projectMTUB/AboutPagesavedvideoId42.png';
import AboutPagesavedShortId43 from './../assets/images/projectMTUB/AboutPagesavedShortId43.png';

export const ReviewData = {
  ru: [
    {
      id: 1,
      img: HomePage,
      review: `Этот макет представляет главную страницу видеоплатформы, выполненную в удобном и понятном стиле. В верхней части экрана расположен логотип "MTUB" и кнопка поиска. Ниже находятся фильтры категорий, позволяющие выбрать тип контента: Все, Мультфильмы, Кино, Сериалы, Аниме.

Основную часть экрана занимает рекомендуемое видео с крупным превью, названием, продолжительностью, статистикой просмотров и источником. Ниже расположен блок Shorts, содержащий ряд коротких видео в виде карточек с яркими обложками.

Внизу экрана размещена навигация, включающая кнопки для перехода в разделы Главная, Shorts, Вы. Дизайн выполнен в минималистичном стиле, ориентированном на удобство пользователя.`,
    },

    {
      id: 2,
      img: SearchPage,
      review: `Этот макет страницы поиска представляет собой простой и удобный интерфейс для поиска видео. В верхней части экрана расположено поле поиска с возможностью ввода текста и значком микрофона для голосового поиска. Ниже отображается история поиска, включающая последние запросы пользователя. Каждый запрос сопровождается миниатюрой видео, что упрощает визуальное восприятие. Справа от каждого запроса есть кнопка перехода (стрелка), позволяющая быстро открыть найденное видео. Дизайн выполнен в минималистичном стиле, ориентирован на удобство пользователя.`,
    },

    {
      id: 3,
      img: HomePagecompass,
      review: `Этот макет представляет боковое меню видеоплатформы, выполненное в минималистичном стиле для удобной навигации. В верхней части размещен логотип "MTUB", а ниже – список разделов: "В тренде" (популярные видео), "Видеоигры" (контент, связанный с играми), "Блогеры" (авторские видео) и "Нашиды" (религиозные песни). В нижней части экрана находятся ссылки на Политику конфиденциальности и Условия использования, обеспечивая пользователю доступ к важной информации.`,
    },

    {
      id: 4,
      img: HomePageadditionalmenu,
      review: `
Этот макет представляет собой всплывающее меню видеоплатформы, выполненное в минималистичном стиле для удобства взаимодействия. В верхней части экрана отображается логотип 'MTUB' и категории контента: 'Все' (общий список), 'Мультфильмы' (анимация), 'Кино' (фильмы), 'Сериалы' (сериалы) и 'Аниме' (японская анимация). В нижней части меню доступны опции: 'Смотреть позже' (добавление в список), 'Сохранить' (добавление в библиотеку), 'Поделиться' (отправка ссылки), 'Не интересует' (скрытие видео), 'Не рекомендовать видео с этого канала' (блокировка рекомендаций) и 'Пожаловаться' (отправка жалобы).`,
    },

    {
      id: 5,
      img: ShortsPage,
      review: `
Этот макет представляет интерфейс просмотра коротких видео на видеоплатформе, выполненный в минималистичном стиле для удобства взаимодействия. В верхней части размещены значки поиска и дополнительного меню, обеспечивающие доступ к дополнительным функциям. В центре экрана отображается видео, а ниже – информация о канале: имя пользователя '@stevenhechinese' и кнопка 'Подписаться'. Справа расположены элементы взаимодействия: кнопки лайка (24K), дизлайка, комментариев и поделиться. В нижней части экрана находятся основные разделы навигации: 'Главная' (основная лента), 'Shorts' (короткие видео) и 'Вы' (профиль пользователя).`,
    },

    {
      id: 6,
      img: AboutPageId6,
      review: `
Этот макет представляет собой страницу библиотеки видеоплатформы, выполненную в светлом минималистичном стиле. В верхней части отображается раздел "История" с последними просмотренными видео от канала "HudaRus", включающими мультфильмы с исламской тематикой. Ниже расположены категории "Смотреть позже" (122 видео), "Сохраненные" (12 видео) и "Понравившиеся" (96 видео). В нижней части страницы находятся разделы "Подписки", "Плейлист", "Время просмотра" и "Справка/отзыв", обеспечивающие удобную навигацию пользователя.`,
    },

    {
      id: 7,
      img: VideoPlaybackPageId7,
      review: `
Этот макет представляет собой страницу воспроизведения видео на видеоплатформе, оформленную в светлом минималистичном стиле. В верхней части находится видеоплеер с прогресс-баром, отображающим текущее время и общую продолжительность. Ниже указано название видео – "Новый СБОРНИК | Мультфильм NUSSA 31-40 серии | 54 минуты | Нусса и Папа", а также количество просмотров, время публикации и хэштеги. Канал "HudaRus" имеет 2.14 млн подписчиков. Под видео расположены кнопки "Нравится" (652), "Поделиться" и "Сохранить". В нижней части экрана – рекомендованное видео с похожим контентом.`,
    },

    {
      id: 8,
      img: VideoPlaybackPageSettingsId8,
      review: `
Этот макет представляет собой экран настроек воспроизведения видео на видеоплатформе, оформленный в светлом минималистичном стиле. В верхней части остается видеоплеер с названием ролика "Новый СБОРНИК | Мультфильм NUSSA 31-40 серии | 54 минуты | Нусса и Папа". Ниже открыто меню с параметрами: "Качество" (авто 360p), "Скорость воспроизведения" (1x), "Субтитры", "Автовыключение" (отключено) и "Дополнительные настройки". Каждый пункт снабжен иконкой и стрелкой для выбора дополнительных опций, обеспечивая удобную персонализацию просмотра.
`,
    },

    {
      id: 9,
      img: VideoPlaybackPagefullscreenId9,
      review: `
Этот макет представляет собой интерфейс видеоплеера на видеоплатформе, выполненный в минималистичном стиле. В верхней части отображается название видео "Новый СБОРНИК | Мультфильм NUSSA 31-40 серии...", а справа расположены кнопки настроек и выхода из полноэкранного режима. В центре экрана находятся элементы управления: кнопка паузы, а также кнопки перемотки вперед и назад. Внизу представлен прогресс-бар с текущим временем (0:07) и общей продолжительностью (47:25). В правом нижнем углу отображается миниатюра следующего видео с надписью "Другие видео", позволяя пользователю быстро переключаться между роликами.`,
    },

    {
      id: 10,
      img: VideoPlaybackPagemoreId10,
      review: `
Этот макет представляет собой интерфейс видеоплатформы с открытым разделом описания видео, оформленный в минималистичном стиле. В верхней части отображается видеоплеер, а ниже – название ролика "Новый СБОРНИК/ МУЛЬТФИЛЬМ NUSSA 21-30 серии / 43 минуты/ Нусса И ПАПА / исламские мультики". Под заголовком показаны статистические данные: 7236 отметок "Нравится", 92 378 просмотров и время публикации (13 часов назад). В центральной части расположен текст описания, который скрывается под кнопкой "ещё". Внизу указана информация о канале "HudaRus" (2.14 млн подписчиков), а также кнопки для перехода к другим видео.
`,
    },

    {
      id: 11,
      img: PersonalPageMainId11,
      review: `
Этот макет представляет собой страницу канала на видеоплатформе, выполненную в минималистичном стиле. В верхней части размещен баннер с названием "HudaRus" и призывом подписаться. Ниже отображается название канала, значок верификации, количество подписчиков (1.2 млн) и общее число видео (3.3 тыс.). В описании содержится информация о деятельности канала и ссылка на приложение. Центральная часть включает кнопку "Подписаться" и навигацию с вкладками: "Главная", "Видео", "Shorts" и "Плейлисты". Внизу показан раздел "Популярные видео" с миниатюрой последнего выпуска, названием и статистикой просмотров.
`,
    },

    {
      id: 12,
      img: VideoPlaybackPageShareId12,
      review: `
Этот макет представляет интерфейс страницы воспроизведения видео с возможностью его шаринга. В верхней части экрана показан кадр из мультфильма "NUSSA" с названием ролика, количеством просмотров и каналом "HudaRus". Ниже расположен всплывающий диалог "Поделиться", содержащий иконки социальных сетей (Facebook, Telegram, Instagram, LinkedIn), а также кнопку "Коп. ссылку" для быстрого копирования ссылки. Внизу экрана размещена кнопка "Отмена", позволяющая закрыть диалоговое окно без выполнения действий.
`,
    },

    {
      id: 13,
      img: VideoPlaybackPageellipsisId13,
      review: `
Этот макет представляет интерфейс страницы воспроизведения видео с открытым дополнительным меню. В верхней части экрана отображен кадр из мультфильма "NUSSA" с названием, количеством просмотров и каналом "HudaRus". Ниже показаны кнопки взаимодействия: лайк, дизлайк, "Поделиться" и "Сохранить". Внизу экрана размещено всплывающее меню с тремя вариантами действий: "Не интересует" (скрытие контента), "Поделиться" (отправка видео), "Пожаловаться" (отметка нарушений). В правом верхнем углу окна находится кнопка закрытия, позволяющая скрыть меню.
`,
    },

    {
      id: 14,
      img: ShortsPageellipsisId14,
      review: `
Этот макет представляет интерфейс видеоплатформы с открытым дополнительным меню управления контентом. В верхней части экрана расположены иконки поиска и настроек, а основной фон черный, что указывает на скрытый или не загруженный контент. Внизу отображено всплывающее меню с четырьмя опциями: "Сохранить" (добавление видео в список), "Качество" (настройка разрешения), "Не интересует" (скрытие контента) и "Не рекомендовать видео с этого канала" (исключение канала из рекомендаций). В правом верхнем углу окна размещена кнопка закрытия для скрытия меню.
`,
    },

    {
      id: 15,
      img: PersonalPageMainId15,
      review: `
Этот макет представляет страницу видеоплатформы с популярным контентом. В верхней части размещены четыре одинаковых превью нового мультфильма "Нуса и Рара: Просите прощения", продолжительностью 12 минут 40 секунд, опубликованного четыре дня назад и набравшего 7,4 тыс. просмотров. Под видео расположены рекомендации каналов. Отображается канал "HudaRus | Канал для детей все самое", у которого 1,2 млн подписчиков и 3,3 тыс. видео. Кнопка подписки выделена красным цветом для акцента. Интерфейс ориентирован на удобное представление контента и привлечение внимания к рекомендациям.
`,
    },


    {
      id: 16,
      img: PersonalPageVideoId16,
      review: `
Этот макет представляет страницу видеоканала на платформе с акцентом на брендирование и контент. В верхней части экрана размещен баннер с текстом "HUDA RUS — Не пропусти новое видео, жми на колокольчик". Ниже отображается информация о канале "HudaRus", включающая логотип, название, количество подписчиков (1,2 млн) и общее число видео (3,3 тыс.). Под описанием канала представлена кнопка "Подписаться". Меню навигации предлагает вкладки: "Главная", "Видео", "Shorts" и "Плейлисты". На вкладке "Популярные" представлены мультфильмы "Нуса и Рара: Просите прощения" с указанием даты публикации и продолжительности. Внизу экрана доступна панель навигации для перехода к главной странице, Shorts и профилю пользователя.
`,
    },


    {
      id: 17,
      img: PersonalPageShortsId17,
      review: `
Этот макет представляет интерфейс страницы видеоканала на платформе. В верхней части экрана размещен баннер с текстом "HUDA RUS — Не пропусти новое видео, жми на колокольчик". Ниже указано название канала "HudaRus", количество подписчиков (1,2 млн) и общее число видео (3,3 тыс.). Присутствует описание канала с возможностью просмотра полного текста и кнопка "Подписаться". Меню навигации предлагает разделы "Главная", "Видео", "Shorts" и "Плейлисты". На активной вкладке "Shorts" представлены три видеоролика с указанием количества просмотров: 5,9 тыс., 529 тыс. и 51,9 тыс. Внизу экрана доступна панель навигации для перехода к основным разделам платформы.
`,
    },


    {
      id: 18,
      img: PersonalPageVideoId18,
      review: `
Этот макет представляет интерфейс канала видеоплатформы, выполненный в современном стиле для комфортного взаимодействия. В верхней части размещен баннер с названием "HUDA RUS" и призывом подписаться на уведомления. Ниже находится название канала "HudaRus" с описанием деятельности и ссылкой на приложение. Кнопка "Подписаться" выделена крупным шрифтом. Центральная часть включает вкладки "Главная", "Видео", "Shorts", "Плейлисты". В разделе "Плейлисты" представлены упорядоченные видео, например, новая серия мультфильма "Нуса и Папа". Интерфейс поддерживает навигацию между разделами через нижнюю панель.
`,
    },




    {
      id: 19,
      img: SearchPageVoiceactiveId19,
      review: `
Опиши загруженное изображение в формате описания интерфейса. Длина текста должна быть такой же, как в этом примере: „Этот макет представляет боковое меню видеоплатформы, выполненное в минималистичном стиле для удобной навигации. В верхней части размещен логотип 'MTUB', а ниже – список разделов: 'В тренде' (популярные видео), 'Видеоигры' (контент, связанный с играми), 'Блогеры' (авторские видео) и 'Нашиды' (религиозные песни). В нижней части экрана находятся ссылки на Политику конфиденциальности и Условия использования, обеспечивая пользователю доступ к важной информации.' Сохрани стиль и объем текста при генерации.`,
    },




    {
      id: 20,
      img: SearchPageVoiceinactiveId20,
      review: `
Этот макет представляет собой экран голосового ввода с уведомлением о необходимости повторной попытки. В верхней части экрана расположены элементы управления: переключатель режимов "Голос" и "Трек", а также значок настроек для доступа к параметрам. В центре отображается сообщение "Повторите попытку", информирующее пользователя об ошибке. Ниже размещена серо-белая кнопка с иконкой микрофона, предлагающая снова активировать голосовой ввод. В нижней части экрана текст "Нажмите на значок микрофона" дает дополнительное указание для пользователя. Дизайн выполнен в минималистичном стиле для удобства восприятия.
`,
},




    {
      id: 21,
      img: SearchPageMusicinactiveId21,
      review: `
Этот макет представляет интерфейс страницы взаимодействия с музыкой, выполненный в минималистичном стиле. В верхней части экрана размещен переключатель режимов "Голос" и "Трек", где активен режим "Голос", выделенный серым цветом. Справа находится значок настроек. В центре экрана отображается сообщение "Повторите попытку", указывающее на необходимость повторного действия. В нижней части экрана размещен текст "Нажмите чтобы повторить попытку", информирующий пользователя о возможности перезапуска процесса. Интерфейс ориентирован на лаконичность и удобство взаимодействия.
`,
},




    {
      id: 22,
      img: SearchPageMusicactiveId22,
      review: `
Этот макет представляет интерфейс музыкального поиска с минималистичным дизайном. В верхней части экрана расположен переключатель режимов "Голос" и "Трек", где активен режим "Голос", выделенный серым цветом. Слева находится кнопка закрытия, а справа — иконка настроек. В центре экрана отображается текст "Включите или напойте мелодию", побуждающий пользователя к действию. Ниже размещена круглая кнопка с иконкой звуковых волн для активации голосового поиска. Фоновый градиент нежно-розового цвета создает приятную визуальную атмосферу. Интерфейс сосредоточен на интуитивном взаимодействии с пользователем.
`,
},




    {
      id: 23,
      img: HomePagecompass23,
      review: `
Этот макет представляет боковое меню видеоплатформы, выполненное в минималистичном стиле для удобной навигации. В верхней части размещен логотип "MTUB", а ниже – список разделов: "В тренде" (популярные видео), "Видеоигры" (контент, связанный с играми), "Блогеры" (авторские видео) и "Нашиды" (религиозные песни). В нижней части экрана находятся ссылки на Политику конфиденциальности и Условия использования, обеспечивая пользователю доступ к важной информации.
`,
},




    {
      id: 24,
      img: Homepagetrendcartoon24,
      review: `
Этот макет представляет главную страницу раздела 'В тренде' на видеоплатформе, выполненную в минималистичном стиле для удобной навигации. В верхней части размещен логотип с красным значком и заголовок 'В тренде', а ниже – список категорий: 'Мультики' (анимация), 'Видеоигры' (игровой контент), 'Блогеры' (авторские видео) и 'Нашиды' (религиозные песни). В центральной части отображаются популярные видео, включая превью, название, продолжительность, количество просмотров и время публикации. В нижней части экрана расположены основные разделы навигации: 'Главная' (основная лента), 'Shorts' (короткие видео) и 'Вы' (профиль пользователя).
`,
},




    {
      id: 25,
      img: Homepagetrendsettinf25,
      review: `
Этот макет представляет главную страницу раздела 'В тренде' на видеоплатформе, выполненную в минималистичном стиле для удобной навигации. В верхней части размещен логотип с красным значком и заголовок 'В тренде', а ниже – категории контента, такие как 'Мультики'. В центральной части отображаются популярные видео с превью, названием, продолжительностью, количеством просмотров и временем публикации. В правом верхнем углу открыто дополнительное меню с пунктами: 'Настройки' (изменение параметров), 'Конфиденциальность и Условия' (доступ к правилам) и 'Справка/отзыв' (обратная связь). В нижней части экрана расположены разделы навигации: 'Главная' (основная лента), 'Shorts' (короткие видео) и 'Вы' (профиль пользователя).
`,
},




    {
      id: 26,
      img: Homepagetrendadditionalmeny26,
      review: `
Этот макет представляет страницу с трендовыми видео на видеоплатформе, выполненную в минималистичном стиле. В верхней части расположен заголовок 'В тренде' с красной иконкой графика, а ниже находятся вкладки 'Мультики', 'Видеоигры', 'Блогеры' и 'Нашиды' для быстрой навигации. В центре экрана отображается популярное видео с изображением девочки в платке, держащей палестинский флаг, с длительностью 12:40. В нижней части экрана открыто дополнительное меню с опциями 'Смотреть позже', 'Сохранить' и 'Поделиться' для удобного взаимодействия с контентом.
`,
},




    {
      id: 27,
      img: HomepageVideoGameId27,
      review: `
Этот макет представляет главную страницу видеоплатформы с акцентом на игровой контент, что подчеркивается заголовком 'Gaming' с красным логотипом контроллера. В верхней части экрана расположены строка поиска и кнопка меню, а ниже – раздел 'Рекомендовано', содержащий видеоролики. Первый предложенный видеофайл – мультипликационный сборник 'NUSSA', представленный миниатюрой с изображением девочки в хиджабе, держащей флаг. В нижней части интерфейса расположены навигационные вкладки: 'Главная', 'Shorts' и 'Вы', обеспечивающие быстрый доступ к разделам платформы.
`,
},



    {
      id: 28,
      img: HomepageBlogersId28,
      review: `
Этот макет представляет главную страницу видеоплатформы с акцентом на авторский контент, что подчеркивается заголовком 'Блогеры' с красным логотипом профиля. В верхней части экрана размещены строка поиска и кнопка меню, а ниже – раздел 'Рекомендовано', включающий подборку видео. Первое видео – мультсборник 'NUSSA', миниатюра которого изображает девочку в хиджабе с флагом. В нижней части интерфейса расположены вкладки навигации: 'Главная', 'Shorts' и 'Вы', обеспечивающие удобный доступ к основным разделам платформы.
`,
},



    {
      id: 29,
      img: HomepageNashidId29,
      review: `
Этот макет представляет главную страницу видеоплатформы с акцентом на религиозный контент, что подчеркивается заголовком 'Нашиды' с красным логотипом ноты. В верхней части экрана размещены строка поиска и кнопка меню, а ниже – раздел 'Рекомендовано', содержащий подборку видео. Первое предложенное видео – мультипликационный сборник 'NUSSA', миниатюра которого изображает девочку в хиджабе с флагом. В нижней части интерфейса расположены вкладки навигации: 'Главная', 'Shorts' и 'Вы', обеспечивающие удобный доступ к основным разделам платформы.
`,
},



    {
      id: 30,
      img: HomepageVideoGamesettingId30,
      review: `
Этот макет представляет главную страницу видеоплатформы с открытым выпадающим меню настроек. В верхней части экрана отображен логотип с красным значком, а ниже – раздел с рекомендованными видео. В списке показаны миниатюры роликов, включая "Новый СБОРНИК | Мультфильм NUSSA 21-30 серии", с информацией о канале "HudaRus", количестве просмотров и времени загрузки. В верхнем правом углу расположено выпадающее меню с тремя пунктами: "Настройки" (доступ к параметрам), "Конфиденциальность и Условия" (политика использования) и "Справка/отзыв" (центр поддержки). Внизу экрана находится панель навигации с разделами "Главная", "Shorts" и "Вы".
`,
},



    {
      id: 31,
      img: HomepageVideoGameadditionalmenyId31,
      review: `
Этот макет представляет главную страницу видеоплатформы с открытым дополнительным меню управления видео. В верхней части экрана расположен логотип раздела "Gaming" с красной иконкой, а ниже отображен заголовок "Рекомендовано". В центре экрана представлена миниатюра видеоролика с изображением персонажа, держащего палестинский флаг. Внизу размещено всплывающее меню с пятью опциями: "Не интересует" (скрытие контента), "Смотреть позже" (добавление в список), "Сохранить" (добавление в плейлист), "Поделиться" (отправка видео) и "Пожаловаться" (жалоба на контент).
`,
},



    {
      id: 32,
      img: ReferenceId32,
      review: `
Этот макет представляет справочный раздел видеоплатформы, оформленный в лаконичном стиле для быстрого поиска информации. В верхней части экрана расположен заголовок 'Справка' и кнопка возврата, а ниже – список популярных справочных ресурсов. Все представленные статьи имеют одинаковое название: 'Как включить звук на YouTube - Справка', что повторяется несколько раз. В центре экрана размещена строка поиска, позволяющая пользователю находить нужную информацию. Интерфейс выполнен в светлых тонах, обеспечивая удобочитаемость и простоту навигации.
`,
},



    {
      id: 33,
      img: HomePageadditionalmenuId33,
      review: `
Этот макет представляет собой всплывающее меню видеоплатформы, выполненное в минималистичном стиле. В верхней части размещен логотип "MTUB", а ниже – разделы навигации: "Все", "Мультфильмы", "Кино", "Сериалы" и "Аниме". В центре экрана показан кадр из видео с надписью "43 мин" и "21-30 серии". Всплывающее меню содержит шесть пунктов: "Смотреть позже", "Сохранить", "Поделиться", "Не интересует", "Не рекомендовать видео с этого канала" и "Пожаловаться", предоставляя пользователю широкий выбор взаимодействия с контентом.
`,
},



    {
      id: 34,
      img: HomePageadditionalmenucomplainId34,
      review: `
Этот макет представляет собой всплывающее окно жалобы на видеоплатформе, выполненное в лаконичном стиле. В верхней части расположен логотип "MTUB", а ниже – категории для навигации: "Все", "Мультфильмы", "Кино", "Сериалы" и "Аниме". В центре экрана отображается видеоплеер с кадром из ролика. Всплывающее окно содержит список причин жалобы, включая "Контент сексуального характера" и "Жестокие или отталкивающие сцены/Пропаганда терроризма". Внизу расположены кнопки "Отмена" и "Пожаловаться", позволяя пользователю подтвердить или отменить выбор.
`,
},



    {
      id: 35,
      img: AboutPageId35,
      review: `
Этот макет представляет страницу истории просмотров видеоплатформы, оформленную в лаконичном стиле для удобного доступа. В верхней части расположены миниатюры недавно просмотренных видео с кнопкой «Посмотреть все». Ниже находятся категории: «Смотреть позже» с числом отложенных видео, «Сохранённые» для избранных записей и «Понравившиеся» с отметками «нравится». В нижней части размещены разделы «Подписки», «Плейлист», «Время просмотра» и «Справка/отзыв», обеспечивая пользователю быстрый доступ к ключевым функциям платформы.
`,
},



    {
      id: 36,
      img: AboutPageSettingId36,
      review: `
Этот макет представляет страницу настроек видеоплатформы, оформленную в лаконичном стиле для удобства пользователей. В верхней части расположены настройки аккаунта: 'Общие' (основные параметры), 'Сменить аккаунт' (управление учетными записями), 'Семейный центр' (настройки для семьи) и 'Уведомления' (оповещения). Далее следуют разделы для подписок, истории просмотров и конфиденциальности. Внизу находятся настройки видео и аудио, включая 'Качество видео' (настройка разрешения) и 'Фоновое воспроизведение' (просмотр в фоновом режиме).
`,
},




    {
      id: 37,
      img: AboutPageSettingContinueId37,
      review: `
Этот макет представляет страницу настроек видеоплатформы, оформленную в минималистичном стиле для удобного взаимодействия. В верхней части расположены параметры аккаунта, такие как «Субтитры», «Экономия трафика», «Скачивание» и «Чат». Ниже находятся разделы «Настройки видео и аудио», включая «Справку», «Условия использования MTUB» и «О приложении». В нижней части экрана размещён раздел «Настройки разработчика», позволяющий пользователю получить доступ к дополнительным возможностям платформы.
`,
},




    {
      id: 38,
      img: AboutPagenotificationId38,
      review: `
Этот макет представляет собой экран уведомлений видеоплатформы, оформленный в лаконичном стиле для удобства восприятия. В верхней части размещены заголовок "Уведомление", кнопка фильтрации "Все" и иконка поиска. Далее идут две категории: "Важное" и "Сегодня", каждая из которых содержит уведомления о выходе новой серии мультфильма "Нус-са и Рара". Уведомления оформлены с миниатюрами, заголовками и временем публикации. Внизу экрана находится навигационная панель с разделами "Главная", "Shorts" и "Вы", позволяя пользователю быстро перемещаться по платформе.
`,
},




    {
      id: 39,
      img: AboutPagehistoryId39,
      review: `
Этот макет представляет страницу истории просмотров на видеоплатформе, выполненную в минималистичном стиле для удобного управления просмотренным контентом. В верхней части размещен заголовок 'История' и строка поиска, позволяющая находить ранее просмотренные видео. Разделы разделены по дням: 'Сегодня' и 'Вчера', где отображаются видео из категории 'Shorts' и стандартные видеоролики с миниатюрами, названием, каналом, продолжительностью и количеством просмотров. В правом верхнем углу находятся значки поиска и дополнительного меню, обеспечивающие доступ к дополнительным функциям.
`,
},




    {
      id: 40,
      img: AboutPageWatchlaterId40,
      review: `
Этот макет представляет страницу списка 'Смотреть позже' на видеоплатформе, выполненную в минималистичном стиле для удобного управления сохраненными видео. В верхней части размещено изображение превью списка, название 'Смотреть позже', имя владельца, количество видео и статус доступа. Ниже находится кнопка 'Воспроизвести все' для запуска всех сохраненных видео подряд. В центральной части расположен список сохраненных видео с миниатюрами, названием, каналом, продолжительностью и датой добавления. В нижней части экрана размещены элементы навигации: 'Главная' (основная лента), 'Shorts' (короткие видео) и 'Вы' (профиль пользователя).
`,
},




    {
      id: 41,
      img: AboutPagesavedAlld41,
      review: `
Этот макет представляет интерфейс страницы «Сохраненные» на видеоплатформе, оформленный в современном стиле. В верхней части размещен баннер с иллюстрацией и названием списка. Ниже находятся кнопки «Воспроизвести все» и загрузки контента. Также представлены фильтры для просмотра: «Все», «Видео» и «Shorts», позволяющие сортировать сохраненные материалы. В списке отображаются видео с миниатюрами, названием, каналом и количеством просмотров. В нижней части экрана размещена навигационная панель с разделами «Главная», «Shorts» и «Вы», обеспечивая удобный доступ к основным функциям платформы.
`,
},




    {
      id: 42,
      img: AboutPagesavedvideoId42,
      review: `
Этот макет представляет страницу сохраненных видео видеоплатформы, оформленную в современном стиле. В верхней части отображается красочный баннер с изображением детей, держащих Коран. Ниже указано имя пользователя "Зайнидинова Мадина", количество видео (18) и статус доступа ("Ограниченный доступ"). Основная кнопка "Воспроизвести все" позволяет запускать плейлист. Под списком категорий "Все", "Видео" и "Shorts" размещены миниатюры сохраненных видео с указанием названия, канала и количества просмотров. Внизу находится навигационное меню с вкладками "Главная", "Shorts" и "Вы".
`,
},




    {
      id: 43,
      img: AboutPagesavedShortId43,
      review: `
Этот макет представляет страницу сохраненных видео на видеоплатформе, выполненную в современном стиле. В верхней части размещено изображение с мусульманскими детьми, держащими Коран, а ниже – информация о пользователе, количестве видео и статусе доступа. Основная часть экрана содержит кнопки навигации: "Все", "Видео" и "Shorts". В разделе "Shorts" отображены миниатюры коротких видео, которые пока не загрузились, но содержат заголовки. В нижней части экрана расположены иконки главных разделов платформы: "Главная", "Shorts" и "Вы", обеспечивая удобный доступ к навигации.
`,
},


























  ],
  ky: [
    {
      id: 1,
      img: HomePage,
      review: `Бул канал чыныгы билим булагы!`,
    },
    {
      id: 2,
      img: SearchPage,
      review: `Биз бул каналдын билим берүүчү видеолорун сүйүп көрөбүз.`,
    },
  ],
};
