import HomePage from './../assets/images/projectMTUB/HomePage.png';
import SearchPage from './../assets/images/projectMTUB/Search Page.png';
import HomePagecompass from './../assets/images/projectMTUB/Home Page compass.png';
import HomePageadditionalmenu from './../assets/images/projectMTUB/HomePageadditionalmenu.png';
import ShortsPage from './../assets/images/projectMTUB/ShortsPage.png';
import AboutPageId6 from './../assets/images/projectMTUB/AboutPageId6.png';
import VideoPlaybackPageId7 from './../assets/images/projectMTUB/VideoPlaybackPageId7.png';
import VideoPlaybackPageSettingsId8 from './../assets/images/projectMTUB/VideoPlaybackPageSettingsId8.png';
import VideoPlaybackPagefullscreenId9 from './../assets/images/projectMTUB/VideoPlaybackPagefullscreenId9.png';
import VideoPlaybackPagemoreId10 from './../assets/images/projectMTUB/VideoPlaybackPagemoreId10.png';
import PersonalPageMainId11 from './../assets/images/projectMTUB/PersonalPageMainId11.png';
import VideoPlaybackPageShareId12 from './../assets/images/projectMTUB/VideoPlaybackPageShareId12.png';
import VideoPlaybackPageellipsisId13 from './../assets/images/projectMTUB/VideoPlaybackPageellipsisId13.png';
import ShortsPageellipsisId14 from './../assets/images/projectMTUB/ShortsPageellipsisId14.png';
import PersonalPageMainId15 from './../assets/images/projectMTUB/PersonalPageMainId15.png';
import PersonalPageVideoId16 from './../assets/images/projectMTUB/PersonalPageVideoId16.png';
import PersonalPageShortsId17 from './../assets/images/projectMTUB/PersonalPageShortsId17.png';
import PersonalPageVideoId18 from './../assets/images/projectMTUB/PersonalPageVideoId18.png';
import SearchPageVoiceactiveId19 from './../assets/images/projectMTUB/SearchPageVoiceactiveId19.png';
import SearchPageVoiceinactiveId20 from './../assets/images/projectMTUB/SearchPageVoiceinactiveId20.png';

export const ReviewData = {
  ru: [
    {
      id: 1,
      img: HomePage,
      review: `Этот макет представляет главную страницу видеоплатформы, выполненную в удобном и понятном стиле. В верхней части экрана расположен логотип "MTUB" и кнопка поиска. Ниже находятся фильтры категорий, позволяющие выбрать тип контента: Все, Мультфильмы, Кино, Сериалы, Аниме.

Основную часть экрана занимает рекомендуемое видео с крупным превью, названием, продолжительностью, статистикой просмотров и источником. Ниже расположен блок Shorts, содержащий ряд коротких видео в виде карточек с яркими обложками.

Внизу экрана размещена навигация, включающая кнопки для перехода в разделы Главная, Shorts, Вы. Дизайн выполнен в минималистичном стиле, ориентированном на удобство пользователя.`,
    },

    {
      id: 2,
      img: SearchPage,
      review: `Этот макет страницы поиска представляет собой простой и удобный интерфейс для поиска видео. В верхней части экрана расположено поле поиска с возможностью ввода текста и значком микрофона для голосового поиска. Ниже отображается история поиска, включающая последние запросы пользователя. Каждый запрос сопровождается миниатюрой видео, что упрощает визуальное восприятие. Справа от каждого запроса есть кнопка перехода (стрелка), позволяющая быстро открыть найденное видео. Дизайн выполнен в минималистичном стиле, ориентирован на удобство пользователя.`,
    },

    {
      id: 3,
      img: HomePagecompass,
      review: `Этот макет представляет боковое меню видеоплатформы, выполненное в минималистичном стиле для удобной навигации. В верхней части размещен логотип "MTUB", а ниже – список разделов: "В тренде" (популярные видео), "Видеоигры" (контент, связанный с играми), "Блогеры" (авторские видео) и "Нашиды" (религиозные песни). В нижней части экрана находятся ссылки на Политику конфиденциальности и Условия использования, обеспечивая пользователю доступ к важной информации.`,
    },

    {
      id: 4,
      img: HomePageadditionalmenu,
      review: `
Этот макет представляет собой всплывающее меню видеоплатформы, выполненное в минималистичном стиле для удобства взаимодействия. В верхней части экрана отображается логотип 'MTUB' и категории контента: 'Все' (общий список), 'Мультфильмы' (анимация), 'Кино' (фильмы), 'Сериалы' (сериалы) и 'Аниме' (японская анимация). В нижней части меню доступны опции: 'Смотреть позже' (добавление в список), 'Сохранить' (добавление в библиотеку), 'Поделиться' (отправка ссылки), 'Не интересует' (скрытие видео), 'Не рекомендовать видео с этого канала' (блокировка рекомендаций) и 'Пожаловаться' (отправка жалобы).`,
    },

    {
      id: 5,
      img: ShortsPage,
      review: `
Этот макет представляет интерфейс просмотра коротких видео на видеоплатформе, выполненный в минималистичном стиле для удобства взаимодействия. В верхней части размещены значки поиска и дополнительного меню, обеспечивающие доступ к дополнительным функциям. В центре экрана отображается видео, а ниже – информация о канале: имя пользователя '@stevenhechinese' и кнопка 'Подписаться'. Справа расположены элементы взаимодействия: кнопки лайка (24K), дизлайка, комментариев и поделиться. В нижней части экрана находятся основные разделы навигации: 'Главная' (основная лента), 'Shorts' (короткие видео) и 'Вы' (профиль пользователя).`,
    },

    {
      id: 6,
      img: AboutPageId6,
      review: `
Этот макет представляет собой страницу библиотеки видеоплатформы, выполненную в светлом минималистичном стиле. В верхней части отображается раздел "История" с последними просмотренными видео от канала "HudaRus", включающими мультфильмы с исламской тематикой. Ниже расположены категории "Смотреть позже" (122 видео), "Сохраненные" (12 видео) и "Понравившиеся" (96 видео). В нижней части страницы находятся разделы "Подписки", "Плейлист", "Время просмотра" и "Справка/отзыв", обеспечивающие удобную навигацию пользователя.`,
    },

    {
      id: 7,
      img: VideoPlaybackPageId7,
      review: `
Этот макет представляет собой страницу воспроизведения видео на видеоплатформе, оформленную в светлом минималистичном стиле. В верхней части находится видеоплеер с прогресс-баром, отображающим текущее время и общую продолжительность. Ниже указано название видео – "Новый СБОРНИК | Мультфильм NUSSA 31-40 серии | 54 минуты | Нусса и Папа", а также количество просмотров, время публикации и хэштеги. Канал "HudaRus" имеет 2.14 млн подписчиков. Под видео расположены кнопки "Нравится" (652), "Поделиться" и "Сохранить". В нижней части экрана – рекомендованное видео с похожим контентом.`,
    },

    {
      id: 8,
      img: VideoPlaybackPageSettingsId8,
      review: `
Этот макет представляет собой экран настроек воспроизведения видео на видеоплатформе, оформленный в светлом минималистичном стиле. В верхней части остается видеоплеер с названием ролика "Новый СБОРНИК | Мультфильм NUSSA 31-40 серии | 54 минуты | Нусса и Папа". Ниже открыто меню с параметрами: "Качество" (авто 360p), "Скорость воспроизведения" (1x), "Субтитры", "Автовыключение" (отключено) и "Дополнительные настройки". Каждый пункт снабжен иконкой и стрелкой для выбора дополнительных опций, обеспечивая удобную персонализацию просмотра.
`,
    },

    {
      id: 9,
      img: VideoPlaybackPagefullscreenId9,
      review: `
Этот макет представляет собой интерфейс видеоплеера на видеоплатформе, выполненный в минималистичном стиле. В верхней части отображается название видео "Новый СБОРНИК | Мультфильм NUSSA 31-40 серии...", а справа расположены кнопки настроек и выхода из полноэкранного режима. В центре экрана находятся элементы управления: кнопка паузы, а также кнопки перемотки вперед и назад. Внизу представлен прогресс-бар с текущим временем (0:07) и общей продолжительностью (47:25). В правом нижнем углу отображается миниатюра следующего видео с надписью "Другие видео", позволяя пользователю быстро переключаться между роликами.`,
    },

    {
      id: 10,
      img: VideoPlaybackPagemoreId10,
      review: `
Этот макет представляет собой интерфейс видеоплатформы с открытым разделом описания видео, оформленный в минималистичном стиле. В верхней части отображается видеоплеер, а ниже – название ролика "Новый СБОРНИК/ МУЛЬТФИЛЬМ NUSSA 21-30 серии / 43 минуты/ Нусса И ПАПА / исламские мультики". Под заголовком показаны статистические данные: 7236 отметок "Нравится", 92 378 просмотров и время публикации (13 часов назад). В центральной части расположен текст описания, который скрывается под кнопкой "ещё". Внизу указана информация о канале "HudaRus" (2.14 млн подписчиков), а также кнопки для перехода к другим видео.
`,
    },

    {
      id: 11,
      img: PersonalPageMainId11,
      review: `
Этот макет представляет собой страницу канала на видеоплатформе, выполненную в минималистичном стиле. В верхней части размещен баннер с названием "HudaRus" и призывом подписаться. Ниже отображается название канала, значок верификации, количество подписчиков (1.2 млн) и общее число видео (3.3 тыс.). В описании содержится информация о деятельности канала и ссылка на приложение. Центральная часть включает кнопку "Подписаться" и навигацию с вкладками: "Главная", "Видео", "Shorts" и "Плейлисты". Внизу показан раздел "Популярные видео" с миниатюрой последнего выпуска, названием и статистикой просмотров.
`,
    },

    {
      id: 12,
      img: VideoPlaybackPageShareId12,
      review: `
Этот макет представляет интерфейс страницы воспроизведения видео с возможностью его шаринга. В верхней части экрана показан кадр из мультфильма "NUSSA" с названием ролика, количеством просмотров и каналом "HudaRus". Ниже расположен всплывающий диалог "Поделиться", содержащий иконки социальных сетей (Facebook, Telegram, Instagram, LinkedIn), а также кнопку "Коп. ссылку" для быстрого копирования ссылки. Внизу экрана размещена кнопка "Отмена", позволяющая закрыть диалоговое окно без выполнения действий.
`,
    },

    {
      id: 13,
      img: VideoPlaybackPageellipsisId13,
      review: `
Этот макет представляет интерфейс страницы воспроизведения видео с открытым дополнительным меню. В верхней части экрана отображен кадр из мультфильма "NUSSA" с названием, количеством просмотров и каналом "HudaRus". Ниже показаны кнопки взаимодействия: лайк, дизлайк, "Поделиться" и "Сохранить". Внизу экрана размещено всплывающее меню с тремя вариантами действий: "Не интересует" (скрытие контента), "Поделиться" (отправка видео), "Пожаловаться" (отметка нарушений). В правом верхнем углу окна находится кнопка закрытия, позволяющая скрыть меню.
`,
    },

    {
      id: 14,
      img: ShortsPageellipsisId14,
      review: `
Этот макет представляет интерфейс видеоплатформы с открытым дополнительным меню управления контентом. В верхней части экрана расположены иконки поиска и настроек, а основной фон черный, что указывает на скрытый или не загруженный контент. Внизу отображено всплывающее меню с четырьмя опциями: "Сохранить" (добавление видео в список), "Качество" (настройка разрешения), "Не интересует" (скрытие контента) и "Не рекомендовать видео с этого канала" (исключение канала из рекомендаций). В правом верхнем углу окна размещена кнопка закрытия для скрытия меню.
`,
    },

    {
      id: 15,
      img: PersonalPageMainId15,
      review: `
Этот макет представляет страницу видеоплатформы с популярным контентом. В верхней части размещены четыре одинаковых превью нового мультфильма "Нуса и Рара: Просите прощения", продолжительностью 12 минут 40 секунд, опубликованного четыре дня назад и набравшего 7,4 тыс. просмотров. Под видео расположены рекомендации каналов. Отображается канал "HudaRus | Канал для детей все самое", у которого 1,2 млн подписчиков и 3,3 тыс. видео. Кнопка подписки выделена красным цветом для акцента. Интерфейс ориентирован на удобное представление контента и привлечение внимания к рекомендациям.
`,
    },


    {
      id: 16,
      img: PersonalPageVideoId16,
      review: `
Этот макет представляет страницу видеоканала на платформе с акцентом на брендирование и контент. В верхней части экрана размещен баннер с текстом "HUDA RUS — Не пропусти новое видео, жми на колокольчик". Ниже отображается информация о канале "HudaRus", включающая логотип, название, количество подписчиков (1,2 млн) и общее число видео (3,3 тыс.). Под описанием канала представлена кнопка "Подписаться". Меню навигации предлагает вкладки: "Главная", "Видео", "Shorts" и "Плейлисты". На вкладке "Популярные" представлены мультфильмы "Нуса и Рара: Просите прощения" с указанием даты публикации и продолжительности. Внизу экрана доступна панель навигации для перехода к главной странице, Shorts и профилю пользователя.
`,
    },


    {
      id: 17,
      img: PersonalPageShortsId17,
      review: `
Этот макет представляет интерфейс страницы видеоканала на платформе. В верхней части экрана размещен баннер с текстом "HUDA RUS — Не пропусти новое видео, жми на колокольчик". Ниже указано название канала "HudaRus", количество подписчиков (1,2 млн) и общее число видео (3,3 тыс.). Присутствует описание канала с возможностью просмотра полного текста и кнопка "Подписаться". Меню навигации предлагает разделы "Главная", "Видео", "Shorts" и "Плейлисты". На активной вкладке "Shorts" представлены три видеоролика с указанием количества просмотров: 5,9 тыс., 529 тыс. и 51,9 тыс. Внизу экрана доступна панель навигации для перехода к основным разделам платформы.
`,
    },


    {
      id: 18,
      img: PersonalPageVideoId18,
      review: `
Этот макет представляет интерфейс канала видеоплатформы, выполненный в современном стиле для комфортного взаимодействия. В верхней части размещен баннер с названием "HUDA RUS" и призывом подписаться на уведомления. Ниже находится название канала "HudaRus" с описанием деятельности и ссылкой на приложение. Кнопка "Подписаться" выделена крупным шрифтом. Центральная часть включает вкладки "Главная", "Видео", "Shorts", "Плейлисты". В разделе "Плейлисты" представлены упорядоченные видео, например, новая серия мультфильма "Нуса и Папа". Интерфейс поддерживает навигацию между разделами через нижнюю панель.
`,
    },




    {
      id: 19,
      img: SearchPageVoiceactiveId19,
      review: `
Опиши загруженное изображение в формате описания интерфейса. Длина текста должна быть такой же, как в этом примере: „Этот макет представляет боковое меню видеоплатформы, выполненное в минималистичном стиле для удобной навигации. В верхней части размещен логотип 'MTUB', а ниже – список разделов: 'В тренде' (популярные видео), 'Видеоигры' (контент, связанный с играми), 'Блогеры' (авторские видео) и 'Нашиды' (религиозные песни). В нижней части экрана находятся ссылки на Политику конфиденциальности и Условия использования, обеспечивая пользователю доступ к важной информации.' Сохрани стиль и объем текста при генерации.`,
    },




    {
      id: 20,
      img: SearchPageVoiceinactiveId20,
      review: `
Этот макет представляет собой экран голосового ввода с уведомлением о необходимости повторной попытки. В верхней части экрана расположены элементы управления: переключатель режимов "Голос" и "Трек", а также значок настроек для доступа к параметрам. В центре отображается сообщение "Повторите попытку", информирующее пользователя об ошибке. Ниже размещена серо-белая кнопка с иконкой микрофона, предлагающая снова активировать голосовой ввод. В нижней части экрана текст "Нажмите на значок микрофона" дает дополнительное указание для пользователя. Дизайн выполнен в минималистичном стиле для удобства восприятия.
`,
},


























  ],
  ky: [
    {
      id: 1,
      img: HomePage,
      review: `Бул канал чыныгы билим булагы!`,
    },
    {
      id: 2,
      img: SearchPage,
      review: `Биз бул каналдын билим берүүчү видеолорун сүйүп көрөбүз.`,
    },
  ],
};
